Repository: 84000/data-translation-memory
Catalog: toh138_84000-the-ratnaketu-dharani.tmx
Source language: bo
Languages: en

source: །གང་གིས་མཆོད་ཕྱིར་དགའ་མགུའི་ཡིད་ཀྱིས་སངས་རྒྱས་རྣམས་ལ་ཕུལ་བ་བས།
en: And offer them to the buddhas with a joyful mind in order to worship them,

source: །གང་ཞིག་ཕྱིན་ཆད་ཟད་འགྱུར་འཇིགས་ལྡན་དུས་ན་མདོ་འདི་འཛིན་བྱེད་ན།
en: But the person who upholds this sūtra later, at a degenerate time full of fear and violence,

source: །དེ་ཡི་བསོད་ནམས་ཚད་དག་སེམས་ཅན་ཀུན་གྱིས་བརྗོད་པར་མི་ནུས་སོ།
en: Would accumulate merit whose extent no being could describe.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས་ཀྱང་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: Even the blessed, thus-gone Śākyamuni spoke as follows:

source: །ཐུབ་པའི་སྤྱན་སྔར་མར་མེའི་སྙིང་པོ་དྲི་ཞིམ་ཏིལ་གྱིས་བྱུགས་པ་རི་རབ་ཙམ།
en: “One could, before this sage, hold up a burning wick fed with scented oil as big as Mount Meru

source: །མར་མེ་བུས་པ་འཛུམ་པའི་བཞིན་གྱིས་གུས་པར་བསྐལ་པ་བྱེ་བར་བཟུང་བ་བས།
en: For the duration of ten million eons, one’s face smiling with devotion,

source: །གང་གཞན་ལ་ལ་བསོད་ནམས་འདོད་པ་བསྒྲིབས་པ་སྲབ་པར་སྨོན་པ་དེ་དག་གིས།
en: But someone desirous of merit and seeking to reduce hindrances

source: །ཟད་པའི་དུས་ཚེ་འཁོར་དུ་མདོ་སྡེའི་གཏམ་བྱས་པ་ནི་བསོད་ནམས་ཁྱད་པར་འཕགས།
en: Would gain far greater merit by teaching this sūtra in public during this degenerate time.”

source: །དེ་ནས་དེ་བཞིན་གཤེགས་པ་མི་འཁྲུགས་པས་ཀྱང་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: The thus-gone Akṣobhya said:

source: །བློ་གྲོས་འཆང་བ་གང་གིས་བཟོད་པ་བསྒོམ་ཞིང་རྟག་ཏུ་བརྩོན་འགྲུས་རྩོམ།
en: “Any intelligent person can always cultivate acceptance and practice diligence.

source: །རྟག་ཏུ་བསམ་གཏན་གཞོལ་ཞིང་མཉམ་གཞག་ལུས་ཀྱིས་ཤེས་རབ་སྤེལ་བ་བབས།
en: Continually devoted to meditation, mindful of their body, they may develop their insight,

source: །ཟད་པའི་དུས་ངན་ཚེ་ན་གང་ཞིག་དམ་ཆོས་ཕྱག་རྒྱ་འདི་འཛིན་པ།
en: But those who uphold this seal of the sacred Dharma in this world during the dark age

source: །དེ་ཡི་བཟོད་དང་བརྩོན་འགྲུས་འདི་ནི་མཚུངས་མེད་ཤེས་རབ་གཞལ་དུ་མེད།
en: Possess unequaled acceptance and diligence, and their insight is also superior.”

source: །དེ་ནས་དེ་བཞིན་གཤེགས་པ་ཏིང་ངེ་འཛིན་རྡུལ་དང་བྲལ་བའི་སྟོབས་ཀྱིས་རྣམ་པར་གནོན་པས་ཀྱང་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: The thus-gone Virajasamādhibalavikrāmin said: “It is not possible to describe the merit acquired

source: །གང་གིས་མདོ་འདི་བཤད་ནས་བཟུང་དང་མངོན་པར་བྲིས་པ་དང་། །གཞན་དག་འཛིན་བཅུག་གུས་པར་རྟག་ཏུ་ཀློག་པ་དང་། །བདུག་པ་མེ་ཏོག་ཕྲེང་བ་གོས་མཆོག་རྣམས་ཀྱིས་མཆོད། །བསོད་ནམས་གང་ཐོབ་དེ་ནི་བརྗོད་པར་མི་ནུས་སོ།
en: By someone who propagates this sūtra in this world, upholds it, writes it down, Causes others to learn it by skillfully explaining it again and again, And worships it with incense, flowers, garlands, and the best quality fabrics.”

source: །དེ་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཚད་མེད་གྲངས་མེད་པ་དེ་དག་གིས། མདོ་སྡེ་འདིའི་བསྔགས་པ་དང་། ཡོན་ཏན་དང་། ཕན་ཡོན་དཔག་ཏུ་མེད་པར་བརྗོད་ནས།
en: Continuing like this, infinite numbers of blessed buddhas proclaimed the immeasurable virtues, qualities, and benefits of this sūtra.

source: བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་དེ་དག་ལ་བོས་ཏེ། འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཀྱེ་གྲོགས་པོ་དག་ལས་ཀྱི་སྒྲིབ་པ་དང་། ཉོན་མོངས་པ་ཐམས་ཅད་བྱང་བར་བྱེད་པ།
en: Having then summoned the world protectors, Śakra, and Brahmā , they instructed them, “Please, friends, uphold this Dharma discourse that exhausts all karmic obscurations and the afflictions.

source: ཕྱི་མའི་དུས་ན་གང་ཐོས་པ་ཙམ་གྱིས་ཀྱང་། སེམས་ཅན་རྣམས་ཀྱི་ལས་ཀྱི་སྒྲིབ་པ་དང་། ཉོན་མོངས་པ་ཐམས་ཅད་ཟད་པར་འགྱུར་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཟུང་ཤིག །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས།
en: By merely hearing this discourse during the later degenerate time, all karmic obscurations and the afflictions of sentient beings will be exhausted.”

source: །ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།
en: So spoke the Blessed One. The entire assembly and the worlds of gods, humans, asuras, and gandharvas rejoiced and praised this teaching by the Blessed One.

source: །འདུས་པ་ཆེན་པོ་རིན་པོ་ཆེ་ཏོག་གི་གཟུངས་ལས། མཐར་ཕྱིན་པའི་ལེའུ་སྟེ། བཅུ་གསུམ་པའོ།།
en: This concludes the thirteenth chapter, the final in the “Ratnaketu Sūtra,” in the Great Collection of Mahāyāna sūtras. Colophon Because of the special merit that I have accumulated when refining, with all my devotion, care, and a joyous mind,

source: །།འཕགས་པ་འདུས་པ་ཆེན་པོ་རིན་པོ་ཆེ་ཏོག་གི་གཟུངས་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།།
en: The text of this Ratnaketu Dhāraṇī—the dhāraṇī that removes great fear— May this entire world obtain in this very moment this Ratnaketu Dhāraṇī Adorned with words of the Sage’s doctrine, clear in meaning, and resplendent with great qualities!

source: །།རྒྱ་གར་གྱི་མཁན་པོ་ཤཱི་ལེནྡྲ་བོ་དྷི་དང་། ཞུ་ཆེན་གྱི་ལོ་ཙྪ་བ་བནྡེ་ཡེ་ཤེས་སྡེས་ཞུས་ཏེ། སྐད་གསར་ཆད་ཀྱིས་ཀྱང་བཅོས་ནས་གཏན་ལ་ཕབ་པ།།
en: Tibetan Translators’ Colophon This sūtra was translated by the Indian preceptor Śilendrabodhi and the translator-editor Yeshé Dé.
